# POSTTEST 2 KB

# Mengimport Library

In [71]:
import pandas as pd

In [72]:
import numpy as np

# MEMBUKA FILE CSV

In [73]:
df = pd.read_csv("Bengaluru_House_Data.csv")

# MENCARI INFORMASI TENTANG ISI DATA CSV

In [74]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   area_type     13320 non-null  object
 1   availability  13320 non-null  object
 2   location      13319 non-null  object
 3   size          13304 non-null  object
 4   society       7818 non-null   object
 5   total_sqft    13320 non-null  object
 6   bath          13247 non-null  float64
 7   balcony       12711 non-null  float64
 8   price         13320 non-null  float64
dtypes: float64(3), object(6)
memory usage: 936.7+ KB

# MEMASUKKAN DATA YANG DIPEROLEH KE DALAM DICTIONARY

In [75]:
infodata = {
'attributes': [],
'object_attributes': 0,
'number_attributes': 0,
'null_attributes': 0,
'total_records': 0,
}

In [76]:
infodata['attributes'] = list(df.columns.values)
infodata['object_attributes'] = list(df.select_dtypes(['object']).columns)
infodata['number_attributes'] = list(df.select_dtypes(['float64', 'int64']).columns)
infodata['null_attributes'] = list(df.loc[:, df.isnull().any()].columns)
infodata['total_records'] = df.shape[0]

# JUMLAH RECORD DATA

In [77]:
print("JUMLAH RECORD DATA :", infodata['total_records'])

JUMLAH RECORD DATA : 13320

# NAMA ATTRIBUTES DATA

In [78]:
print("NAMA SELURUH ATTRIBUTES DATA :", infodata['attributes'])

NAMA SELURUH ATTRIBUTES DATA : ['area_type', 'availability', 'location', 'size', 'society', 'total_sqft', 'bath', 'balcony', 'price']

# JUMLAH ATTRIBUTES DATA, TIPE ANGKA, TIPE OBJEK, DAN NULL

In [79]:
print("TOTAL ATTRIBUTES DATA :", len(infodata['attributes']))
print("BANYAK ATTRIBUTES DENGAN TIPE OBJEK :", len(infodata['object_attributes']))
print("BANYAK ATTRIBUTES DENGAN TIPE ANGKA :", len(infodata['number_attributes']))
print("JUMLAH ATTRIBUTES NULL :", len(infodata['null_attributes']))

TOTAL ATTRIBUTES DATA : 9
BANYAK ATTRIBUTES DENGAN TIPE OBJEK : 6
BANYAK ATTRIBUTES DENGAN TIPE ANGKA : 3
JUMLAH ATTRIBUTES NULL : 5

# Menampilkan RATA-RATA, STD, MIN, MAX, Q1, Q2, Q3

In [80]:
df.describe()

               bath       balcony         price
count  13247.000000  12711.000000  13320.000000
mean       2.692610      1.584376    112.565627
std        1.341458      0.817263    148.971674
min        1.000000      0.000000      8.000000
25%        2.000000      1.000000     50.000000
50%        2.000000      2.000000     72.000000
75%        3.000000      2.000000    120.000000
max       40.000000      3.000000   3600.000000

# MENAMPILKAN NILAI KORELASI

In [98]:
df.corr()

C:\Users\Lenovo\AppData\Local\Temp\ipykernel_13200\1134722465.py:1: FutureWarning: The default value of numeric_only in DataFrame.corr is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.corr()

          balcony     price
balcony  1.000000  0.120355
price    0.120355  1.000000

# MENGUBAH ATRIBUT "balcony" Menjadi bilangan bulat

# SEBELUM DIUBAH

In [118]:
df.dtypes

area_type        object
availability     object
location         object
size             object
society          object
total_sqft       object
bath            float64
balcony          object
price           float64
dtype: object

In [119]:
df['balcony'] = df['balcony'].astype('float64')

# SESUDAH DIUBAH

In [120]:
df.dtypes

area_type        object
availability     object
location         object
size             object
society          object
total_sqft       object
bath            float64
balcony         float64
price           float64
dtype: object

In [112]:
df.head(10)

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00
5,Super built-up Area,Ready To Move,Whitefield,2 BHK,DuenaTa,1170,2.0,1.0,38.00
6,Super built-up Area,18-May,Old Airport Road,4 BHK,Jaades,2732,4.0,NaN,204.00
7,Super built-up Area,Ready To Move,Rajaji Nagar,4 BHK,Brway G,3300,4.0,NaN,600.00
8,Super built-up Area,Ready To Move,Marathahalli,3 BHK,NaN,1310,3.0,1.0,63.25
9,Plot Area,Ready To Move,Gandhi Bazar,6 Bedroom,NaN,1020,6.0,NaN,370.00

# MENAMPILKAN 10 RECORD PERTAMA ATRIBUT ANGKA

In [121]:
dh = df.select_dtypes(include=np.number)
dh.head(10)

   bath  balcony   price
0   2.0      1.0   39.07
1   5.0      3.0  120.00
2   2.0      3.0   62.00
3   3.0      1.0   95.00
4   2.0      1.0   51.00
5   2.0      1.0   38.00
6   4.0      NaN  204.00
7   4.0      NaN  600.00
8   3.0      1.0   63.25
9   6.0      NaN  370.00

In [122]:
df[['bath', 'balcony', 'price']].to_csv

<bound method NDFrame.to_csv of        bath  balcony   price
0       2.0      1.0   39.07
1       5.0      3.0  120.00
2       2.0      3.0   62.00
3       3.0      1.0   95.00
4       2.0      1.0   51.00
...     ...      ...     ...
13315   4.0      0.0  231.00
13316   5.0      NaN  400.00
13317   2.0      1.0   60.00
13318   4.0      1.0  488.00
13319   1.0      1.0   17.00

[13320 rows x 3 columns]>